Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/CS_356.0.xml
<module id="CS" HW_revision="356.0">
    <register id="CSKEY" width="32" offset="0x0" internal="0" description="Key Register">
        <bitfield id="CSKEY" description="Write xxxx_695Ah to unlock" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="CSCTL0" width="32" offset="0x4" internal="0" description="Control 0 Register">
        <bitfield id="DCOTUNE" description="DCO frequency tuning select" begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
        <bitfield id="DCORSEL" description="DCO frequency range select" begin="18" end="16" width="3" rwaccess="R/W">
            <bitenum id="DCORSEL_0" value="0x0" description="Nominal DCO Frequency Range (MHz): 1 to 2"/>
            <bitenum id="DCORSEL_1" value="0x1" description="Nominal DCO Frequency Range (MHz): 2 to 4"/>
            <bitenum id="DCORSEL_2" value="0x2" description="Nominal DCO Frequency Range (MHz): 4 to 8"/>
            <bitenum id="DCORSEL_3" value="0x3" description="Nominal DCO Frequency Range (MHz): 8 to 16"/>
            <bitenum id="DCORSEL_4" value="0x4" description="Nominal DCO Frequency Range (MHz): 16 to 32"/>
            <bitenum id="DCORSEL_5" value="0x5" description="Nominal DCO Frequency Range (MHz): 32 to 64"/>
        </bitfield>
        <bitfield id="DCORES" description="Enables the DCO external resistor mode" begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="INTERNAL" value="0x0" description="Internal resistor mode"/>
            <bitenum id="EXTERNAL" value="0x1" description="External resistor mode"/>
        </bitfield>
        <bitfield id="DCOEN" description="Enables the DCO oscillator" begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="DCO is on if it is used as a source for MCLK, HSMCLK , or SMCLK and clock is requested, otherwise it is disabled."/>
            <bitenum id="ON" value="0x1" description="DCO is on"/>
        </bitfield>
    </register>
    <register id="CSCTL1" width="32" offset="0x8" internal="0" description="Control 1 Register">
        <bitfield id="SELM" description="Selects the MCLK source" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="LFXTCLK" value="0x0" description="when LFXT available, otherwise REFOCLK"/>
            <bitenum id="VLOCLK" value="0x1" description=""/>
            <bitenum id="REFOCLK" value="0x2" description=""/>
            <bitenum id="DCOCLK" value="0x3" description=""/>
            <bitenum id="MODOSC" value="0x4" description=""/>
            <bitenum id="HFXTCLK" value="0x5" description="when HFXT available, otherwise DCOCLK"/>
        </bitfield>
        <bitfield id="SELS" description="Selects the SMCLK and HSMCLK source" begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="LFXTCLK" value="0x0" description="when LFXT available, otherwise REFOCLK"/>
            <bitenum id="VLOCLK" value="0x1" description=""/>
            <bitenum id="REFOCLK" value="0x2" description=""/>
            <bitenum id="DCOCLK" value="0x3" description=""/>
            <bitenum id="MODOSC" value="0x4" description=""/>
            <bitenum id="HFXTCLK" value="0x5" description="when HFXT available, otherwise DCOCLK"/>
        </bitfield>
        <bitfield id="SELA" description="Selects the ACLK source" begin="10" end="8" width="3" rwaccess="R/W">
            <bitenum id="LFXTCLK" value="0x0" description="when LFXT available, otherwise REFOCLK"/>
            <bitenum id="VLOCLK" value="0x1" description=""/>
            <bitenum id="REFOCLK" value="0x2" description=""/>
        </bitfield>
        <bitfield id="SELB" description="Selects the BCLK source" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="LFXTCLK" value="0x0" description="LFXTCLK"/>
            <bitenum id="REFOCLK" value="0x1" description="REFOCLK"/>
        </bitfield>
        <bitfield id="DIVM" description="MCLK source divider" begin="18" end="16" width="3" rwaccess="R/W">
            <bitenum id="1" value="0x0" description="f(MCLK)/1"/>
            <bitenum id="2" value="0x1" description="f(MCLK)/2"/>
            <bitenum id="4" value="0x2" description="f(MCLK)/4"/>
            <bitenum id="8" value="0x3" description="f(MCLK)/8"/>
            <bitenum id="16" value="0x4" description="f(MCLK)/16"/>
            <bitenum id="32" value="0x5" description="f(MCLK)/32"/>
            <bitenum id="64" value="0x6" description="f(MCLK)/64"/>
            <bitenum id="128" value="0x7" description="f(MCLK)/128"/>
        </bitfield>
        <bitfield id="DIVHS" description="HSMCLK source divider" begin="22" end="20" width="3" rwaccess="R/W">
            <bitenum id="1" value="0x0" description="f(HSMCLK)/1"/>
            <bitenum id="2" value="0x1" description="f(HSMCLK)/2"/>
            <bitenum id="4" value="0x2" description="f(HSMCLK)/4"/>
            <bitenum id="8" value="0x3" description="f(HSMCLK)/8"/>
            <bitenum id="16" value="0x4" description="f(HSMCLK)/16"/>
            <bitenum id="32" value="0x5" description="f(HSMCLK)/32"/>
            <bitenum id="64" value="0x6" description="f(HSMCLK)/64"/>
            <bitenum id="128" value="0x7" description="f(HSMCLK)/128"/>
        </bitfield>
        <bitfield id="DIVA" description="ACLK source divider" begin="26" end="24" width="3" rwaccess="R/W">
            <bitenum id="1" value="0x0" description="f(ACLK)/1"/>
            <bitenum id="2" value="0x1" description="f(ACLK)/2"/>
            <bitenum id="4" value="0x2" description="f(ACLK)/4"/>
            <bitenum id="8" value="0x3" description="f(ACLK)/8"/>
            <bitenum id="16" value="0x4" description="f(ACLK)/16"/>
            <bitenum id="32" value="0x5" description="f(ACLK)/32"/>
            <bitenum id="64" value="0x6" description="f(ACLK)/64"/>
            <bitenum id="128" value="0x7" description="f(ACLK)/128"/>
        </bitfield>
        <bitfield id="DIVS" description="SMCLK source divider" begin="30" end="28" width="3" rwaccess="R/W">
            <bitenum id="1" value="0x0" description="f(SMCLK)/1"/>
            <bitenum id="2" value="0x1" description="f(SMCLK)/2"/>
            <bitenum id="4" value="0x2" description="f(SMCLK)/4"/>
            <bitenum id="8" value="0x3" description="f(SMCLK)/8"/>
            <bitenum id="16" value="0x4" description="f(SMCLK)/16"/>
            <bitenum id="32" value="0x5" description="f(SMCLK)/32"/>
            <bitenum id="64" value="0x6" description="f(SMCLK)/64"/>
            <bitenum id="128" value="0x7" description="f(SMCLK)/128"/>
        </bitfield>
    </register>
