Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/CS_356.0.xml
    <register id="CSCTL2" width="32" offset="0xC" internal="0" description="Control 2 Register">
        <bitfield id="LFXTDRIVE" description="LFXT oscillator current can be adjusted to its drive needs" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="LFXTDRIVE_0" value="0x0" description="Lowest drive strength and current consumption LFXT oscillator."/>
            <bitenum id="LFXTDRIVE_1" value="0x1" description="Increased drive strength LFXT oscillator."/>
            <bitenum id="LFXTDRIVE_2" value="0x2" description="Increased drive strength LFXT oscillator."/>
            <bitenum id="LFXTDRIVE_3" value="0x3" description="Maximum drive strength and maximum current consumption LFXT oscillator."/>
        </bitfield>
        <bitfield id="LFXTAGCOFF" description="Disables the automatic gain control of the LFXT crystal" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="LFXTAGCOFF_0" value="0x0" description="AGC enabled."/>
            <bitenum id="LFXTAGCOFF_1" value="0x1" description="AGC disabled."/>
        </bitfield>
        <bitfield id="LFXT_EN" description="Turns on the LFXT oscillator regardless if used as a clock resource" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LFXT is on if it is used as a source for ACLK, MCLK, HSMCLK , or SMCLK and is selected via the port selection and not in bypass mode of operation."/>
            <bitenum id="ON" value="0x1" description="LFXT is on if LFXT is selected via the port selection and LFXT is not in bypass mode of operation."/>
        </bitfield>
        <bitfield id="LFXTBYPASS" description="LFXT bypass select" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="LFXT sourced by external crystal."/>
            <bitenum id="ON" value="0x1" description="LFXT sourced by external square wave."/>
        </bitfield>
        <bitfield id="HFXTDRIVE" description="HFXT oscillator drive selection" begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="HFXTDRIVE_0" value="0x0" description="To be used for HFXTFREQ setting 000b"/>
            <bitenum id="HFXTDRIVE_1" value="0x1" description="To be used for HFXTFREQ settings 001b to 110b"/>
        </bitfield>
        <bitfield id="HFXTFREQ" description="HFXT frequency selection" begin="22" end="20" width="3" rwaccess="R/W">
            <bitenum id="HFXTFREQ_0" value="0x0" description="1 MHz to 4 MHz"/>
            <bitenum id="HFXTFREQ_1" value="0x1" description="4 MHz to 8 MHz"/>
            <bitenum id="HFXTFREQ_2" value="0x2" description="8 MHz to 16 MHz"/>
            <bitenum id="HFXTFREQ_3" value="0x3" description="16 MHz to 24 MHz"/>
            <bitenum id="HFXTFREQ_4" value="0x4" description="24 MHz to 32 MHz"/>
            <bitenum id="HFXTFREQ_5" value="0x5" description="32 MHz to 40 MHz"/>
            <bitenum id="HFXTFREQ_6" value="0x6" description="40 MHz to 48 MHz"/>
            <bitenum id="HFXTFREQ_7" value="0x7" description="Reserved for future use."/>
        </bitfield>
        <bitfield id="HFXT_EN" description="Turns on the HFXT oscillator regardless if used as a clock resource" begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="HFXT is on if it is used as a source for MCLK, HSMCLK , or SMCLK and is selected via the port selection and not in bypass mode of operation."/>
            <bitenum id="ON" value="0x1" description="HFXT is on if HFXT is selected via the port selection and HFXT is not in bypass mode of operation."/>
        </bitfield>
        <bitfield id="HFXTBYPASS" description="HFXT bypass select" begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="HFXTBYPASS_0" value="0x0" description="HFXT sourced by external crystal."/>
            <bitenum id="HFXTBYPASS_1" value="0x1" description="HFXT sourced by external square wave."/>
        </bitfield>
    </register>
    <register id="CSCTL3" width="32" offset="0x10" internal="0" description="Control 3 Register">
        <bitfield id="FCNTLF" description="Start flag counter for LFXT" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="4096" value="0x0" description="4096 cycles"/>
            <bitenum id="8192" value="0x1" description="8192 cycles"/>
            <bitenum id="16384" value="0x2" description="16384 cycles"/>
            <bitenum id="32768" value="0x3" description="32768 cycles"/>
        </bitfield>
        <bitfield id="RFCNTLF" description="Reset start fault counter for LFXT" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="RFCNTLF_0" value="0x0" description="Not applicable. Always reads as zero due to self clearing."/>
            <bitenum id="RESTART" value="0x1" description="Restarts the counter immediately."/>
        </bitfield>
        <bitfield id="FCNTLF_EN" description="Enable start fault counter for LFXT" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="Startup fault counter disabled. Counter is cleared."/>
            <bitenum id="ON" value="0x1" description="Startup fault counter enabled."/>
        </bitfield>
        <bitfield id="FCNTHF" description="Start flag counter for HFXT" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="2048" value="0x0" description="2048 cycles"/>
            <bitenum id="4096" value="0x1" description="4096 cycles"/>
            <bitenum id="8192" value="0x2" description="8192 cycles"/>
            <bitenum id="16384" value="0x3" description="16384 cycles"/>
        </bitfield>
        <bitfield id="RFCNTHF" description="Reset start fault counter for HFXT" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="RFCNTHF_0" value="0x0" description="Not applicable. Always reads as zero due to self clearing."/>
            <bitenum id="RESTART" value="0x1" description="Restarts the counter immediately."/>
        </bitfield>
        <bitfield id="FCNTHF_EN" description="Enable start fault counter for HFXT" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="Startup fault counter disabled. Counter is cleared."/>
            <bitenum id="ON" value="0x1" description="Startup fault counter enabled."/>
        </bitfield>
        <bitfield id="FCNTHF2" description="Start flag counter for HFXT2" begin="9" end="8" width="2" rwaccess="R/W">
            <bitenum id="2048" value="0x0" description="2048 cycles"/>
            <bitenum id="4096" value="0x1" description="4096 cycles"/>
            <bitenum id="8192" value="0x2" description="8192 cycles"/>
            <bitenum id="16384" value="0x3" description="16384 cycles"/>
        </bitfield>
        <bitfield id="RFCNTHF2" description="Reset start fault counter for HFXT2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="RFCNTHF2_0" value="0x0" description="Not applicable. Always reads as zero due to self clearing."/>
            <bitenum id="RESTART" value="0x1" description="Restarts the counter immediately."/>
        </bitfield>
        <bitfield id="FCNTHF2_EN" description="Enable start fault counter for HFXT2" begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="Startup fault counter disabled. Counter is cleared."/>
            <bitenum id="ON" value="0x1" description="Startup fault counter enabled."/>
        </bitfield>
    </register>
