Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/CS_356.0.xml
    <register id="CSCLKEN" width="32" offset="0x30" internal="0" description="Clock Enable Register">
        <bitfield id="ACLK_EN" description="ACLK system clock conditional request enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="ACLK disabled regardless of conditional clock requests"/>
            <bitenum id="ENABLE" value="0x1" description="ACLK enabled based on any conditional clock requests"/>
        </bitfield>
        <bitfield id="MCLK_EN" description="MCLK system clock conditional request enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="MCLK disabled regardless of conditional clock requests"/>
            <bitenum id="ENABLE" value="0x1" description="MCLK enabled based on any conditional clock requests"/>
        </bitfield>
        <bitfield id="HSMCLK_EN" description="HSMCLK system clock conditional request enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="HSMCLK disabled regardless of conditional clock requests"/>
            <bitenum id="ENABLE" value="0x1" description="HSMCLK enabled based on any conditional clock requests"/>
        </bitfield>
        <bitfield id="SMCLK_EN" description="SMCLK system clock conditional request enable" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SMCLK disabled regardless of conditional clock requests."/>
            <bitenum id="ENABLE" value="0x1" description="SMCLK enabled based on any conditional clock requests"/>
        </bitfield>
        <bitfield id="VLO_EN" description="Turns on the VLO oscillator" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="VLO is on only if it is used as a source for ACLK, MCLK, HSMCLK or SMCLK."/>
            <bitenum id="ON" value="0x1" description="VLO is on"/>
        </bitfield>
        <bitfield id="REFO_EN" description="Turns on the REFO oscillator" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="REFO is on only if it is used as a source for ACLK, MCLK, HSMCLK or SMCLK"/>
            <bitenum id="ON" value="0x1" description="REFO is on"/>
        </bitfield>
        <bitfield id="MODOSC_EN" description="Turns on the MODOSC oscillator" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="OFF" value="0x0" description="MODOSC is on only if it is used as a source for ACLK, MCLK, HSMCLK or SMCLK"/>
            <bitenum id="ON" value="0x1" description="MODOSC is on"/>
        </bitfield>
        <bitfield id="REFOFSEL" description="Selects REFO nominal frequency" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="32" value="0x0" description="32 kHz"/>
            <bitenum id="128" value="0x1" description="128 kHz"/>
        </bitfield>
    </register>
    <register id="CSSTAT" width="32" offset="0x34" internal="0" description="Status Register">
        <bitfield id="DCO_ON" description="DCO status" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="DCOBIAS_ON" description="DCO bias status" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="HFXT_ON" description="HFXT status" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="HFXT2_ON" description="HFXT2 status" begin="3" end="3" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="MODOSC_ON" description="MODOSC status" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="VLO_ON" description="VLO status" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="LFXT_ON" description="LFXT status" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="REFO_ON" description="REFO status" begin="7" end="7" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="ACLK_ON" description="ACLK system clock status" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="MCLK_ON" description="MCLK system clock status" begin="17" end="17" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="HSMCLK_ON" description="HSMCLK system clock status" begin="18" end="18" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="SMCLK_ON" description="SMCLK system clock status" begin="19" end="19" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="MODCLK_ON" description="MODCLK system clock status" begin="20" end="20" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="VLOCLK_ON" description="VLOCLK system clock status" begin="21" end="21" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="LFXTCLK_ON" description="LFXTCLK system clock status" begin="22" end="22" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="REFOCLK_ON" description="REFOCLK system clock status" begin="23" end="23" width="1" rwaccess="R">
            <bitenum id="INACTIVE" value="0x0" description="Inactive"/>
            <bitenum id="ACTIVE" value="0x1" description="Active"/>
        </bitfield>
        <bitfield id="ACLK_READY" description="ACLK Ready status" begin="24" end="24" width="1" rwaccess="R">
            <bitenum id="NOT_READY" value="0x0" description="Not ready"/>
            <bitenum id="READY" value="0x1" description="Ready"/>
        </bitfield>
        <bitfield id="MCLK_READY" description="MCLK Ready status" begin="25" end="25" width="1" rwaccess="R">
            <bitenum id="NOT_READY" value="0x0" description="Not ready"/>
            <bitenum id="READY" value="0x1" description="Ready"/>
        </bitfield>
        <bitfield id="HSMCLK_READY" description="HSMCLK Ready status" begin="26" end="26" width="1" rwaccess="R">
            <bitenum id="NOT_READY" value="0x0" description="Not ready"/>
            <bitenum id="READY" value="0x1" description="Ready"/>
        </bitfield>
        <bitfield id="SMCLK_READY" description="SMCLK Ready status" begin="27" end="27" width="1" rwaccess="R">
            <bitenum id="NOT_READY" value="0x0" description="Not ready"/>
            <bitenum id="READY" value="0x1" description="Ready"/>
        </bitfield>
        <bitfield id="BCLK_READY" description="BCLK Ready status" begin="28" end="28" width="1" rwaccess="R">
            <bitenum id="NOT_READY" value="0x0" description="Not ready"/>
            <bitenum id="READY" value="0x1" description="Ready"/>
        </bitfield>
    </register>
