Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/CS_356.0.xml
    <register id="CSIE" width="32" offset="0x40" internal="0" description="Interrupt Enable Register">
        <bitfield id="LFXTIE" description="LFXT oscillator fault flag interrupt enable" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="HFXTIE" description="HFXT oscillator fault flag interrupt enable" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="HFXT2IE" description="HFXT2 oscillator fault flag interrupt enable" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="DCOR_OPNIE" description="DCO external resistor open circuit fault flag interrupt enable." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="FCNTLFIE" description="Start fault counter interrupt enable LFXT" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="FCNTHFIE" description="Start fault counter interrupt enable HFXT" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="FCNTHF2IE" description="Start fault counter interrupt enable HFXT2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="PLLOOLIE" description="PLL out-of-lock interrupt enable" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="PLLLOSIE" description="PLL loss-of-signal interrupt enable" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="PLLOORIE" description="PLL out-of-range interrupt enable" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
        <bitfield id="CALIE" description="REFCNT period counter interrupt enable" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Interrupt disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Interrupt enabled"/>
        </bitfield>
    </register>
    <register id="CSIFG" width="32" offset="0x48" internal="0" description="Interrupt Flag Register">
        <bitfield id="LFXTIFG" description="LFXT oscillator fault flag" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="LFXTIFG_0" value="0x0" description="No fault condition occurred after the last reset"/>
            <bitenum id="LFXTIFG_1" value="0x1" description="LFXT fault. A LFXT fault occurred after the last reset"/>
        </bitfield>
        <bitfield id="HFXTIFG" description="HFXT oscillator fault flag" begin="1" end="1" width="1" rwaccess="R">
            <bitenum id="HFXTIFG_0" value="0x0" description="No fault condition occurred after the last reset"/>
            <bitenum id="HFXTIFG_1" value="0x1" description="HFXT fault. A HFXT fault occurred after the last reset"/>
        </bitfield>
        <bitfield id="HFXT2IFG" description="HFXT2 oscillator fault flag" begin="2" end="2" width="1" rwaccess="R">
            <bitenum id="HFXT2IFG_0" value="0x0" description="No fault condition occurred after the last reset"/>
            <bitenum id="HFXT2IFG_1" value="0x1" description="HFXT2 fault. A HFXT2 fault occurred after the last reset"/>
        </bitfield>
        <bitfield id="DCOR_SHTIFG" description="DCO external resistor short circuit fault flag." begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="DCOR_SHTIFG_0" value="0x0" description="DCO external resistor present"/>
            <bitenum id="DCOR_SHTIFG_1" value="0x1" description="DCO external resistor short circuit fault"/>
        </bitfield>
        <bitfield id="DCOR_OPNIFG" description="DCO external resistor open circuit fault flag." begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="DCOR_OPNIFG_0" value="0x0" description="DCO external resistor present"/>
            <bitenum id="DCOR_OPNIFG_1" value="0x1" description="DCO external resistor open circuit fault"/>
        </bitfield>
        <bitfield id="FCNTLFIFG" description="Start fault counter interrupt flag LFXT" begin="8" end="8" width="1" rwaccess="R">
            <bitenum id="FCNTLFIFG_0" value="0x0" description="Start counter not expired"/>
            <bitenum id="FCNTLFIFG_1" value="0x1" description="Start counter expired"/>
        </bitfield>
        <bitfield id="FCNTHFIFG" description="Start fault counter interrupt flag HFXT" begin="9" end="9" width="1" rwaccess="R">
            <bitenum id="FCNTHFIFG_0" value="0x0" description="Start counter not expired"/>
            <bitenum id="FCNTHFIFG_1" value="0x1" description="Start counter expired"/>
        </bitfield>
        <bitfield id="FCNTHF2IFG" description="Start fault counter interrupt flag HFXT2" begin="11" end="11" width="1" rwaccess="R">
            <bitenum id="FCNTHF2IFG_0" value="0x0" description="Start counter not expired"/>
            <bitenum id="FCNTHF2IFG_1" value="0x1" description="Start counter expired"/>
        </bitfield>
        <bitfield id="PLLOOLIFG" description="PLL out-of-lock interrupt flag" begin="12" end="12" width="1" rwaccess="R">
            <bitenum id="PLLOOLIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="PLLOOLIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="PLLLOSIFG" description="PLL loss-of-signal interrupt flag" begin="13" end="13" width="1" rwaccess="R">
            <bitenum id="PLLLOSIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="PLLLOSIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="PLLOORIFG" description="PLL out-of-range interrupt flag" begin="14" end="14" width="1" rwaccess="R">
            <bitenum id="PLLOORIFG_0" value="0x0" description="No interrupt pending"/>
            <bitenum id="PLLOORIFG_1" value="0x1" description="Interrupt pending"/>
        </bitfield>
        <bitfield id="CALIFG" description="REFCNT period counter expired" begin="15" end="15" width="1" rwaccess="R">
            <bitenum id="CALIFG_0" value="0x0" description="REFCNT period counter not expired"/>
            <bitenum id="CALIFG_1" value="0x1" description="REFCNT period counter expired"/>
        </bitfield>
    </register>
    <register id="CSCLRIFG" width="32" offset="0x50" internal="0" description="Clear Interrupt Flag Register">
        <bitfield id="CLR_LFXTIFG" description="Clear LFXT oscillator fault interrupt flag" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="CLR_LFXTIFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLR_LFXTIFG_1" value="0x1" description="Clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLR_HFXTIFG" description="Clear HFXT oscillator fault interrupt flag" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="CLR_HFXTIFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLR_HFXTIFG_1" value="0x1" description="Clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLR_HFXT2IFG" description="Clear HFXT2 oscillator fault interrupt flag" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="CLR_HFXT2IFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLR_HFXT2IFG_1" value="0x1" description="Clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLR_DCOR_OPNIFG" description="Clear DCO external resistor open circuit fault interrupt flag." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="CLR_DCOR_OPNIFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLR_DCOR_OPNIFG_1" value="0x1" description="Clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLR_CALIFG" description="REFCNT period counter clear interrupt flag" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="CLR_CALIFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLR_CALIFG_1" value="0x1" description="Clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLR_FCNTLFIFG" description="Start fault counter clear interrupt flag LFXT" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="CLR_FCNTLFIFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLR_FCNTLFIFG_1" value="0x1" description="Clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLR_FCNTHFIFG" description="Start fault counter clear interrupt flag HFXT" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="CLR_FCNTHFIFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLR_FCNTHFIFG_1" value="0x1" description="Clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLR_FCNTHF2IFG" description="Start fault counter clear interrupt flag HFXT2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="CLR_FCNTHF2IFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLR_FCNTHF2IFG_1" value="0x1" description="Clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLR_PLLOOLIFG" description="PLL out-of-lock clear interrupt flag" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="CLR_PLLOOLIFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLR_PLLOOLIFG_1" value="0x1" description="Clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLR_PLLLOSIFG" description="PLL loss-of-signal clear interrupt flag" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="CLR_PLLLOSIFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLR_PLLLOSIFG_1" value="0x1" description="Clear pending interrupt flag"/>
        </bitfield>
        <bitfield id="CLR_PLLOORIFG" description="PLL out-of-range clear interrupt flag" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="CLR_PLLOORIFG_0" value="0x0" description="No effect"/>
            <bitenum id="CLR_PLLOORIFG_1" value="0x1" description="Clear pending interrupt flag"/>
        </bitfield>
    </register>
