Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/CS_356.0.xml
    <register id="CSSETIFG" width="32" offset="0x58" internal="0" description="Set Interrupt Flag Register">
        <bitfield id="SET_LFXTIFG" description="Set LFXT oscillator fault interrupt flag" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SET_LFXTIFG_0" value="0x0" description="No effect"/>
            <bitenum id="SET_LFXTIFG_1" value="0x1" description="Set pending interrupt flag"/>
        </bitfield>
        <bitfield id="SET_HFXTIFG" description="Set HFXT oscillator fault interrupt flag" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="SET_HFXTIFG_0" value="0x0" description="No effect"/>
            <bitenum id="SET_HFXTIFG_1" value="0x1" description="Set pending interrupt flag"/>
        </bitfield>
        <bitfield id="SET_HFXT2IFG" description="Set HFXT2 oscillator fault interrupt flag" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="SET_HFXT2IFG_0" value="0x0" description="No effect"/>
            <bitenum id="SET_HFXT2IFG_1" value="0x1" description="Set pending interrupt flag"/>
        </bitfield>
        <bitfield id="SET_DCOR_OPNIFG" description="Set DCO external resistor open circuit fault interrupt flag." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="SET_DCOR_OPNIFG_0" value="0x0" description="No effect"/>
            <bitenum id="SET_DCOR_OPNIFG_1" value="0x1" description="Set pending interrupt flag"/>
        </bitfield>
        <bitfield id="SET_CALIFG" description="REFCNT period counter set interrupt flag" begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="SET_CALIFG_0" value="0x0" description="No effect"/>
            <bitenum id="SET_CALIFG_1" value="0x1" description="Set pending interrupt flag"/>
        </bitfield>
        <bitfield id="SET_FCNTHFIFG" description="Start fault counter set interrupt flag HFXT" begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="SET_FCNTHFIFG_0" value="0x0" description="No effect"/>
            <bitenum id="SET_FCNTHFIFG_1" value="0x1" description="Set pending interrupt flag"/>
        </bitfield>
        <bitfield id="SET_FCNTHF2IFG" description="Start fault counter set interrupt flag HFXT2" begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="SET_FCNTHF2IFG_0" value="0x0" description="No effect"/>
            <bitenum id="SET_FCNTHF2IFG_1" value="0x1" description="Set pending interrupt flag"/>
        </bitfield>
        <bitfield id="SET_FCNTLFIFG" description="Start fault counter set interrupt flag LFXT" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="SET_FCNTLFIFG_0" value="0x0" description="No effect"/>
            <bitenum id="SET_FCNTLFIFG_1" value="0x1" description="Set pending interrupt flag"/>
        </bitfield>
        <bitfield id="SET_PLLOOLIFG" description="PLL out-of-lock set interrupt flag" begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="SET_PLLOOLIFG_0" value="0x0" description="No effect"/>
            <bitenum id="SET_PLLOOLIFG_1" value="0x1" description="Set pending interrupt flag"/>
        </bitfield>
        <bitfield id="SET_PLLLOSIFG" description="PLL loss-of-signal set interrupt flag" begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="SET_PLLLOSIFG_0" value="0x0" description="No effect"/>
            <bitenum id="SET_PLLLOSIFG_1" value="0x1" description="Set pending interrupt flag"/>
        </bitfield>
        <bitfield id="SET_PLLOORIFG" description="PLL out-of-range set interrupt flag" begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="SET_PLLOORIFG_0" value="0x0" description="No effect"/>
            <bitenum id="SET_PLLOORIFG_1" value="0x1" description="Set pending interrupt flag"/>
        </bitfield>
    </register>
    <register id="CSDCOERCAL0" width="32" offset="0x60" internal="0" description="DCO External Resistor Cailbration 0 Register">
        <bitfield id="DCO_TCCAL" description="DCO Temperature compensation calibration" begin="1" end="0" width="2" rwaccess="R/W">
        </bitfield>
        <bitfield id="DCO_FCAL_RSEL04" description="DCO frequency calibration for DCO frequency range (DCORSEL) 0 to 4." begin="25" end="16" width="10" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="CSDCOERCAL1" width="32" offset="0x64" internal="0" description="DCO External Resistor Calibration 1 Register">
        <bitfield id="DCO_FCAL_RSEL5" description="DCO frequency calibration for DCO frequency range (DCORSEL) 5." begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
    </register>
</module>
